{
  "privacyPolicy": {
    "effectiveDate": "January 01, 2024",
    "introduction": "At SafeHouse, we value your trust and are committed to protecting your privacy. This Privacy Policy explains how we collect, use, and protect your information when you use our app to store notes and passwords. By using SafeHouse, you agree to the terms outlined in this policy.",
    "sections": [
      {
        "title": "1. Information We Collect",
        "content": {
          "heading": "We only collect information that is necessary to provide a secure and seamless experience. This includes:",
          "bulletPoints": [
            "Personal Information: Email addresses or usernames used for account creation and authentication.",
            "Content: Notes, passwords, and any other data you save in the app. This content is encrypted and stored securely.",
            "Device Information: Non-identifiable technical data such as device type, operating system, and app version for improving app performance."
          ]
        }
      },
      {
        "title": "2. How We Use Your Information",
        "content": {
          "heading": "Your data is used to:",
          "bulletPoints": [
            "Provide the core functionalities of the app, including storing and retrieving your notes and passwords.",
            "Improve our app’s performance and enhance user experience.",
            "Securely sync your data across devices (if cloud sync is enabled)."
          ]
        }
      },
      {
        "title": "3. Data Security",
        "content": {
          "heading": "We implement strict security measures to protect your information:",
          "bulletPoints": [
            "Encryption: All notes and passwords are encrypted using advanced security protocols.",
            "Restricted Access: Only you can access your saved content; we cannot view your encrypted data.",
            "Secure Transmission: Data is transmitted securely to prevent unauthorized access."
          ]
        }
      },
      {
        "title": "4. Sharing Your Data",
        "content": {
          "heading": "We do not sell, trade, or share your personal information with third parties. Your data will only be shared if required by law or to prevent fraudulent activities.",
          "bulletPoints": []
        }
      },
      {
        "title": "5. Your Choices and Control",
        "content": {
          "heading": "You have full control over your data:",

          "bulletPoints": [
            "Access and Edit: View and update your saved notes and passwords anytime.",
            "Delete Your Data: Permanently delete your account and all associated data from the app.",
            "Opt-Out: Disable cloud sync if you prefer to store data locally on your device."
          ]
        }
      },
      {
        "title": "6. Third-Party Services",
        "content": {
          "heading": "SafeHouse may use third-party services for analytics or crash reporting. These services are bound by their privacy policies and are selected to ensure data security.",
          "bulletPoints": []
        }
      },
      {
        "title": "7. Children’s Privacy",
        "content": {
          "heading": "SafeHouse is not intended for use by individuals under the age of 13. We do not knowingly collect data from children.",
          "bulletPoints": []
        }
      },
      {
        "title": "8. Changes to This Policy",
        "content": {
          "heading": "We may update this Privacy Policy to reflect changes in our practices or legal requirements. You will be notified of significant updates, and the latest version will always be available in the app.",
          "bulletPoints": []
        }
      },
      {
        "title": "9. Contact Us",
        "content": {
          "heading": "If you have any questions, concerns, or requests regarding this Privacy Policy, you can fill the form on contact page of the website or contact us on",
          "bulletPoints": ["Email: mabhishek0221@gmail.com"]
        }
      }
    ],
    "conclusion": "By using SafeHouse, you acknowledge that you have read and agree to this Privacy Policy. Your trust is our top priority, and we are dedicated to keeping your data safe and private."
  }
}
